report/document.tex
% Created 2023-05-11 Thu 15:26
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,10pt,compsoc,conference]{IEEEtran}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\PassOptionsToPackage{table,xcdraw}{xcolor}
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{amsthm}
\usepackage{amsfonts}
\usepackage{graphicx}
\usepackage{colortbl}
\usepackage{enumitem}
\usepackage[ruled, lined, longend, linesnumbered]{algorithm2e}
\usepackage{bm}
\usepackage{listings}
\usepackage[dvipsnames]{xcolor}
\usepackage{palatino}
\usepackage{palatino}
\usepackage{caption}
\usepackage{array}
\usepackage{pgf}
\usepackage{lmodern}
\usepackage{import}
\usepackage{layouts}
\usepackage{supertabular}
%\usepackage{xtab,afterpage}
\usepackage{makecell}
\setcounter{secnumdepth}{3}
\setlength{\partopsep}{1em}
\DeclareMathOperator*{\argmax}{arg\,max}
\DeclareMathOperator*{\argmin}{arg\,min}
\lstset{basicstyle=\ttfamily, keywordstyle=\bfseries, language=Python, float}
\captionsetup[table]{skip=10pt,justification=centering}
\renewcommand{\arraystretch}{1.4}
\setcounter{secnumdepth}{3}
\author{Matteo Franzil, Luis Augusto Dias Knob}
\date{2023-05-11}
\title{On Exploiting gzip's Content-Dependent Compression}
\hypersetup{
 pdfauthor={Matteo Franzil, Luis Augusto Dias Knob},
 pdftitle={On Exploiting gzip's Content-Dependent Compression},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\usepackage{natbib}
\begin{document}

\maketitle
\setlength{\parskip}{1pt}

\section{Introduction}
\label{sec:orgbf69b7c}

Despite the development of more recent compression techniques like \texttt{bzip2}
and \texttt{xz,} \texttt{gzip} is still a well-liked UNIX compression tool. Gzip is
employed as the default compression technique in the majority of Linux and
UNIX distributions. Although it has a somewhat poor compression ratio when
compared to other utilities, this can be justified by its simplicity and
quick compression and decompression times
\citep{GNUGzip,deutschDEFLATECompressedData1996}. This is also true for some
tools, like \texttt{containerd}, which employs gzip as its standard compression
technique for its image layers
\citep{MakeImageLayer,SupportParallelDecompression}.

In this report, we explore the possibility of exploiting gzip's
algorithm for artificially increasing the decompression time of a file. By
creating files filled with semi-random data generated with various methods,
we show that compression and decompression times may vary significantly
depending on the content of the file and the compression level used. Indeed,
we show that the decompression time of a file can be increased by a factor of
3 in the worst case, when compared to the decompression time of a file
containing English text.

\section{Results}
\label{sec:org27037a0}

\subsection{System setup}
\label{sec:org10faca4}

We run our experiments on a machine with a 4-core Intel Xeon Silver 4112 CPU
@ 2.60GHz, 64GB of RAM, running Ubuntu Server 20.04.2 LTS. We used \texttt{gzip}
version 1.12 on both machines. Tests were run in isolation and with
CPU pinning, in order to reduce the impact of other processes on the results,
and were run 5 times to reduce the impact of noise.

Our tests comprised the following steps:

\begin{enumerate}
\item Generate a file of 100MB in size, with a specific content
\item Compress the file with gzip
\item Decompress the file with gzip
\end{enumerate}

We measured the time taken by each step, the size of the compressed and
uncompressed files, the CPU usage, and the compression ratios. We repeated
this test for each of \texttt{gzip}'s compression levels (1-9). 

\subsection{Popular tools}
\label{sec:orga0e3bd6}

We first started by analyzing the compression and decompression times of
files generated with some popular random data generators. We generated files
with the following tools \citep{strandbergLorem2022}:

\begin{itemize}
\item \texttt{od -{}-format=x /dev/urandom | head -c 1G}
\item \texttt{base64 /dev/urandom | head -c 1G}
\item \texttt{cat /dev/urandom | tr -dc 'a-zA-Z0-9' | head -c 1G}
\item \texttt{openssl rand -out myfile "\$( echo 1G | numfmt -{}-from=iec )"}
\item \texttt{lorem -c 1000000000}
\end{itemize}

We then compressed and decompressed these files with gzip, using the methods
described above. The decompression times are shown in \autoref{fig:popular-tools}.

\begin{figure}
  \begin{center}
    \input{./drawable/results-v1.pgf}
  \end{center}
  \caption{Decompression times for files generated with popular tools.}
  \label{fig:popular-tools}
\end{figure}

We can see that the decompression times vary significantly
depending on the tool used to generate the file. For example, the file
generated by \texttt{lorem}, containing English text, is decompressed in 3 seconds.
\texttt{openssl} and direct \texttt{/dev/urandom} output are decompressed in 4.5 seconds.
Finally, the files generated by \texttt{base64} and \texttt{tr} require between 7 and 8
seconds to be decompressed, depending on the compression level used. Finally,
\texttt{od}'s output is decompressed in 9 seconds. 

\subsection{\texttt{od}'s output}
\label{sec:org27060b5}

Wishing to understand why \texttt{od}'s output was decompressed slower than the
others, we decided to fully leverage \texttt{od}'s various output formats. We thus
generated files with the following output formats:

\begin{itemize}
\item \texttt{x} (hexadecimal)
\item \texttt{a}, \texttt{c} (ASCII both named and unnamed)
\item \texttt{d1}, \texttt{d2}, \texttt{d4}, \texttt{d8} (decimal)
\item \texttt{f} (floating point)
\item \texttt{o} (octal)
\item \texttt{u1}, \texttt{u2}, \texttt{u4}, \texttt{u8} (unsigned decimal)
\end{itemize}

We decided to use the decimal and unsigned decimal format variants with 1, 2,
4, and 8 bytes in order to see if the size of the numbers (and the minus sign
in decimal formats) had any impact on the decompression time. It must be
remembered we voluntarily un-padded the results of \texttt{od}, and thus, the files
are comprised of a single line of content with no spaces or newlines.

We repeated the same tests as before, and the results are shown in
\autoref{fig:od-output}, although with 100MB files instead of 1GB files, due
to the long time required to generate the files.

\begin{figure}[h!]
  \begin{center}
    \input{./drawable/results-od.pgf}
  \end{center}
  \caption{Decompression times for files generated with ~od~'s various output formats.}
  \label{fig:od-output}
\end{figure}

We can see that the decompression times vary significantly depending on the
output format chosen. For our nefarious purposes, the best output formats (at
level 6, the default one) are \texttt{a} and \texttt{c} (ASCII named and unnamed), although
\texttt{x} almost matches them.

\subsection{Finding the optimal file}
\label{sec:orgf7c9361}

Finally, the graph in \autoref{fig:all} shows the decompression times for
\texttt{od}'s best output formats along with the other tools.

\begin{figure}[h]
  \begin{center}
    \input{./drawable/results-v2.pgf}
  \end{center}
  \caption{Decompression times for files generated with ~od~'s best output formats and the other tools.}
  \label{fig:all}
\end{figure}

\subsection{Other results}
\label{sec:orgb1809d0}

To verify that our results were not specific to our machine, we also ran the
same tests on a MacBook Pro (late 2020) with an M1 CPU, 16GB of RAM, and
running macOS Ventura 13.3.1 (a). We used the same version of \texttt{gzip} as on
Ubuntu (1.12). Results were similar, although the MacBook Pro was on average
faster than the Ubuntu machine. We thus do not include the results in this
report.

Furthermore, we tried various file sizes, between 100MB and 1GB, in order to
verify there was also no correlation between the file size and the results.
Again, we found that the results were comparable, and thus we only reported
the results once for the 100MB files.


\section{Conclusions}
\label{sec:orgd43c62f}

We have shown that the decompression time of a file can vary significantly
depending on the content of the file and the compression level used. Indeed,
we have shown that the decompression time of a file can be increased by a
factor of 3 when files are filled with datafrom \texttt{od}'s \texttt{a} and \texttt{c} output formats,
when compared to the decompression time of a file containing English text.

We believe that this is a serious issue, as it can be used to artificially
increase the decompression time of a file, which can be used to slow down
systems that rely on gzip for decompression. For example, this could be used
to slow down the unpacking of Docker images, which use gzip for compression
of the various layers.

\section{Bibliography}
\label{sec:org69fa9ca}

\bibliographystyle{plain}
\bibliography{/Users/matte/Codice/fbk/gziptests/report/gzip}

\section{Appendix}
\label{sec:org6bcffaf}

The following are the full results of our tests for the last graph in the
previous section. 

%\input{results-v2.tex}
\end{document}